In [2]:
import pandas as pd
import numpy as np

# Creating a DF

In [2]:
# Make my own DF
Name = ["Tom", "Jane", "Alice"]
Age = [20, 21, 19]
Major = ["Business", "Data Analytics", "Business"]

toDF = {"Name": Name, "Age": Age, "Major": Major}

DF = pd.DataFrame(toDF)

DF.head()

    Name  Age           Major
0    Tom   20        Business
1   Jane   21  Data Analytics
2  Alice   19        Business

In [3]:
# With Lists
toDF2 = [["Tom", 20, "Business"], ["Jane", 21, "Data Analytics"], ["Alice", 19, "Business"]]
DF2 = pd.DataFrame(toDF2,columns = ["Name", "Age", "Major"])

DF2.head()

    Name  Age           Major
0    Tom   20        Business
1   Jane   21  Data Analytics
2  Alice   19        Business

In [4]:
# From URL
urlDF = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv"

DF3 = pd.read_csv(urlDF)

DF3.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [5]:
# From your Computer
pathDF = "/Users/cparlett/Desktop/Desktop/School/CPSC392parlettpelleriti/Data/penguins.csv"
DF4 = pd.read_csv(pathDF)

DF4.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

# Exploring your DF

In [6]:
# Checking out your DF
DF4.shape

(344, 9)

In [7]:
# Column names
DF4.columns

Index(['Unnamed: 0', 'species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex', 'year'],
      dtype='object')

In [8]:
# What do your columns look like?
DF4.info()
DF4.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         344 non-null    int64
 1   species            344 non-null    object
 2   island             344 non-null    object
 3   bill_length_mm     342 non-null    float64
 4   bill_depth_mm      342 non-null    float64
 5   flipper_length_mm  342 non-null    float64
 6   body_mass_g        342 non-null    float64
 7   sex                333 non-null    object
 8   year               344 non-null    int64
dtypes: float64(4), int64(2), object(3)
memory usage: 24.3+ KB

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,344.000000,342.000000,342.000000,342.000000,342.000000,344.000000
mean,62.151163,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,40.430199,5.459584,1.974793,14.061714,801.954536,0.818356
min,0.000000,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,28.000000,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,57.000000,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,94.250000,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,151.000000,59.600000,21.500000,231.000000,6300.000000,2009.000000

In [9]:
DF4.head(12)

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
5,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007
6,6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,female,2007
7,7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,male,2007
8,8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
9,9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN,2007
10,10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,2007
11,11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN,2007

In [10]:
# first 12 rows

In [11]:
# Check for missing values
DF4.isnull().sum()

Unnamed: 0            0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [30]:
DF4 = DF4.dropna()
DF4.isnull().sum()

Unnamed: 0           0
species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  0
year                 0
billRatio            0
dtype: int64

In [12]:
# Pulling certain rows/columns/sets
DF4["species"]

0         Adelie
1         Adelie
2         Adelie
3         Adelie
4         Adelie
         ...
339    Chinstrap
340    Chinstrap
341    Chinstrap
342    Chinstrap
343    Chinstrap
Name: species, Length: 344, dtype: object

In [13]:
DF4["bill_length_mm"].mean()

43.9219298245614

In [14]:
DF4.iloc[8]

Unnamed: 0                   8
species                 Adelie
island               Torgersen
bill_length_mm            34.1
bill_depth_mm             18.1
flipper_length_mm          193
body_mass_g               3475
sex                        NaN
year                      2007
Name: 8, dtype: object

In [15]:
#9th row
DF4.iloc[[8]]

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
8,8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007

In [16]:
#3-8 row
DF4.iloc[2:7]

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
5,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007
6,6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,female,2007

In [24]:
torg = DF4["island"] == "Torgersen"
DF4.loc[torg].head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,billRatio
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,2.090909
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,2.270115
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,2.238889
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,1.901554

In [18]:
shortboi = DF4["bill_length_mm"] < 39

DF4.loc[shortboi]

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007
6,6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,female,2007
8,8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
10,10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,2007
11,11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN,2007
...,...,...,...,...,...,...,...,...,...
144,144,Adelie,Dream,37.3,16.8,192.0,3000.0,female,2009
147,147,Adelie,Dream,36.6,18.4,184.0,3475.0,female,2009
148,148,Adelie,Dream,36.0,17.8,195.0,3450.0,female,2009
149,149,Adelie,Dream,37.8,18.1,193.0,3750.0,male,2009
150,150,Adelie,Dream,36.0,17.1,187.0,3700.0,female,2009

In [23]:
shortboi2 = (DF4["bill_length_mm"] < 39) & (DF4["bill_depth_mm"] < 18)

DF4.loc[shortboi2].head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,billRatio
6,6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,female,2007,2.185393
10,10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,2007,2.210526
11,11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN,2007,2.184971
15,15,Adelie,Torgersen,36.6,17.8,185.0,3700.0,female,2007,2.056180
24,24,Adelie,Biscoe,38.8,17.2,180.0,3800.0,male,2007,2.255814

In [20]:
DF4.loc[shortboi2, "body_mass_g"].mean()

3335.0

## Adding Data to a Data Frame

In [21]:
DF4["billRatio"] = DF4.bill_length_mm/DF4.bill_depth_mm

In [22]:
DF4.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,billRatio
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,2.090909
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,2.270115
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,2.238889
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,1.901554

## Numpy Vector Operations

In [38]:
x = np.array([1,2,3,4,5,6])
x_list = [1,2,3,4,5,6]

In [39]:
x[2]

3

In [40]:
x_list[2]

3

In [34]:
x*3

array([ 3,  6,  9, 12, 15, 18])

In [41]:
x_list*3

[1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6]

In [42]:
y = np.array([2,2,2,2,2,2])
y_list = [2,2,2,2,2,2]

In [43]:
x + y

array([3, 4, 5, 6, 7, 8])

In [44]:
x_list + y_list

[1, 2, 3, 4, 5, 6, 2, 2, 2, 2, 2, 2]

In [45]:
# distances
x - y

array([-1,  0,  1,  2,  3,  4])

In [46]:
(x-y)**2

array([ 1,  0,  1,  4,  9, 16])

In [47]:
np.sum((x-y)**2)

31

In [48]:
np.sqrt(np.sum((x-y)**2))

5.5677643628300215

In [49]:
# the norm way
np.linalg.norm(x-y)

5.5677643628300215

## Random Numbers

In [4]:
np.random.normal(loc = 0,scale = 1, size = 10)

array([-0.30626262, -1.69578877, -1.92264972, -0.75690091,  0.11766563,
       -0.82616001, -2.07061302, -1.42876613,  0.00747307, -0.9157442 ])

In [5]:
np.random.choice(["Chelsea", "Tony", "Julie", "Chris", "Quinn"])

'Chelsea'

In [6]:
np.random.uniform(low = 0, high = 1, size = 10)

array([0.4791568 , 0.53096912, 0.50986133, 0.34583704, 0.8677424 ,
       0.0468108 , 0.11537126, 0.86797072, 0.20780127, 0.78596732])

In [7]:
np.random.choice(["A","B"], size = 100, replace = True)

array(['A', 'A', 'B', 'A', 'B', 'A', 'B', 'A', 'B', 'A', 'A', 'A', 'B',
       'A', 'A', 'A', 'B', 'A', 'B', 'B', 'B', 'A', 'B', 'B', 'B', 'B',
       'A', 'A', 'B', 'A', 'B', 'A', 'B', 'A', 'A', 'B', 'A', 'B', 'B',
       'B', 'B', 'A', 'B', 'B', 'A', 'B', 'B', 'A', 'B', 'A', 'A', 'B',
       'B', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'A', 'A', 'A', 'A', 'A',
       'B', 'A', 'B', 'A', 'B', 'B', 'B', 'A', 'A', 'A', 'A', 'B', 'A',
       'B', 'A', 'B', 'A', 'B', 'A', 'A', 'A', 'B', 'A', 'B', 'A', 'A',
       'A', 'A', 'B', 'A', 'A', 'B', 'A', 'A', 'A'], dtype='<U1')

In [9]:
np.random.seed(1234)
np.random.normal(0,1,1)

array([0.47143516])